Conector3.0/Entrega 5 (Junio)/apache-tomcat-8.5.23/logs/connector-messages.log

2018-06-01 17:49:12,668 DEBUG connectorMessages:38 - [RQ-C] GenericMessage [payload=<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ps="http://ps.agesic.gub.uy">
   <soapenv:Header/>
   <soapenv:Body>
      <ps:NotificationRequest>
         <subscriber>AGESIC</subscriber>
         <topic>ACEE PROVEDORES</topic>
      </ps:NotificationRequest>
   </soapenv:Body>
</soapenv:Envelope>, headers={content-length=341, http_requestMethod=POST, replyChannel=org.springframework.messaging.core.GenericMessagingTemplate$TemporaryReplyChannel@6955e544, errorChannel=org.springframework.messaging.core.GenericMessagingTemplate$TemporaryReplyChannel@6955e544, soapaction="", http_requestUrl=http://10.120.41.1:9800/connector-runtime/pubsub, content-type=text/xml;charset=UTF-8, connection=Keep-Alive, id=f8bf9496-fc4b-c6f0-0f6c-76e88ae14be2, initialTimestamp=1527886152619, timestamp=1527886152629}]
2018-06-01 17:49:16,796 DEBUG connectorMessages:42 - [RQ-PDI] GenericMessage [payload=<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ps="http://ps.agesic.gub.uy">
   <soapenv:Header><wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" soapenv:actor="actor"><saml:Assertion xmlns:saml="urn:oasis:names:tc:SAML:1.0:assertion" AssertionID="Assertion-uuidbd1c8d86-0163-14f7-9ec4-d01390658a03" IssueInstant="2018-06-01T20:49:15Z" Issuer="Urudata" MajorVersion="1" MinorVersion="1"><saml:Conditions NotBefore="2018-06-01T20:34:14Z" NotOnOrAfter="2018-06-01T21:04:16Z"><saml:AudienceRestrictionCondition><saml:Audience>http://testservicios.pge.red.uy/acce/rupe/novedadesproveedores/consumo</saml:Audience></saml:AudienceRestrictionCondition></saml:Conditions><saml:AuthenticationStatement AuthenticationInstant="2018-06-01T20:49:15Z" AuthenticationMethod="urn:oasis:names:tc:SAML:1.0:am:password"><saml:Subject><saml:NameIdentifier>ou=test,o=agesic,o=presidencia de la republica,O=Poder Ejecutivo,O=Gobierno Nacional,o=Gobierno,C=UY</saml:NameIdentifier></saml:Subject></saml:AuthenticationStatement><saml:AttributeStatement><saml:Subject><saml:NameIdentifier>ou=test,o=agesic,o=presidencia de la republica,O=Poder Ejecutivo,O=Gobierno Nacional,o=Gobierno,C=UY</saml:NameIdentifier></saml:Subject><saml:Attribute AttributeName="User" AttributeNamespace="urn:tokensimple"><saml:AttributeValue>conector</saml:AttributeValue></saml:Attribute></saml:AttributeStatement><ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#" Id="uuidbd1c8d87-0163-160a-94b8-d01390658a03"><ds:SignedInfo><ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/><ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/><ds:Reference URI="#Assertion-uuidbd1c8d86-0163-14f7-9ec4-d01390658a03"><ds:Transforms><ds:Transform Algorithm="http://www.w3.org/2000/09/xmldsig#enveloped-signature"/><ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"><xc14n:InclusiveNamespaces xmlns:xc14n="http://www.w3.org/2001/10/xml-exc-c14n#" PrefixList="saml"/></ds:Transform></ds:Transforms><ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/><ds:DigestValue>z4bSXb4q9SMN8T2w5DtfTHcUCP4=</ds:DigestValue></ds:Reference></ds:SignedInfo><ds:SignatureValue>q8PxaqFw/9OO3CWUVr5t0D7BkfvR0LTEOhbOof6qTIvcgTrKzkW9q3FJB2ZIRqj+adYFY1LDFTNKrmwFePb7+nQ6+AWWxbk57TCP9WWt5oE+ZXAbHsKYrpvHagBIJN3ebGmp9qAxeGMMktFL5m12pLMZWZ0cXqtiSNRkxbsS8Gc=</ds:SignatureValue><ds:KeyInfo><ds:X509Data><ds:X509Certificate>MIICLTCCAZagAwIBAgIHRMVbhCU5uDANBgkqhkiG9w0BAQUFADBIMQswCQYDVQQGEwJVUzEPMA0GA1UEChMGVGl2b2xpMQ4wDAYDVQQLEwVUQU1lQjEYMBYGA1UEAxMPZmltZGVtby5pYm0uY29tMB4XDTE3MTIyNjE2MjI0NloXDTIyMTIyNTE2MjI0NlowSDELMAkGA1UEBhMCVVMxDzANBgNVBAoTBlRpdm9saTEOMAwGA1UECxMFVEFNZUIxGDAWBgNVBAMTD2ZpbWRlbW8uaWJtLmNvbTCBnzANBgkqhkiG9w0BAQEFAAOBjQAwgYkCgYEAtyluxZVcCb9SMv0HbEBC1cUOW/Sr1LG1WH/cGVaT5EauZCKKX/W08BklajviqtVJQdw0piQs0hDwsaY9zOYnQFZlJf0eQueAgM81ALoiclxbpOQv4l+JjGx3hmZvOAzOBVecPIgzbZ5wx+R/HV+gcy0u7x9M2Tzx1YU3rS0pw1cCAwEAAaMhMB8wHQYDVR0OBBYEFE6DmxJcJVR6ydQNPjzchJ705Uf7MA0GCSqGSIb3DQEBBQUAA4GBAI86hFdIMSU5gmLL8V9mBDVUne1WcHgCgWQMSdwehdplM0qX0GPT2n2+9kZJa5IkMTJz3+h3xgMr3e9mQ69LdLBm9tF0WdwbIuoC9Qmpl+viXJQJLyftznPVFc0SzUcojNS617ekccd2dm6n8rG36wn2tZQq61qG+aUdTYWqgRQO</ds:X509Certificate></ds:X509Data></ds:KeyInfo></ds:Signature></saml:Assertion></wsse:Security><wsa:To xmlns:wsa="http://www.w3.org/2005/08/addressing">http://testservicios.pge.red.uy/acce/rupe/novedadesproveedores/consumo</wsa:To><wsa:Action xmlns:wsa="http://www.w3.org/2005/08/addressing">recibirNovedad</wsa:Action></soapenv:Header>
   <soapenv:Body>
      <ps:NotificationRequest>
         <subscriber>AGESIC</subscriber>
         <topic>ACEE PROVEDORES</topic>
      </ps:NotificationRequest>
   </soapenv:Body>
</soapenv:Envelope>, headers={content-length=341, http_requestMethod=POST, errorChannel=org.springframework.messaging.core.GenericMessagingTemplate$TemporaryReplyChannel@6955e544, soapaction="", configuration=gub.agesic.connector.dataaccess.entity.ConnectorGlobalConfiguration@20, serviceUrl=https://testservicios.pge.red.uy:6368/novedades/RecibirNovedadService, replyChannel=org.springframework.messaging.core.GenericMessagingTemplate$TemporaryReplyChannel@6955e544, http_requestUrl=http://10.120.41.1:9800/connector-runtime/pubsub, content-type=text/xml;charset=UTF-8, connection=Keep-Alive, stsExecutionTime=646, id=df306e9a-76ae-85e2-80e3-3b32af1fc149, initialTimestamp=1527886152619, timestamp=1527886156796}]
2018-06-01 17:49:18,627 DEBUG connectorMessages:207 - [RS-C]: GenericMessage [payload=java.io.ByteArrayInputStream@10668a03, headers={replyChannel=org.springframework.messaging.core.GenericMessagingTemplate$TemporaryReplyChannel@570736f0, errorChannel=org.springframework.messaging.core.GenericMessagingTemplate$TemporaryReplyChannel@570736f0, id=3d6091c8-d509-b02e-946b-2acb9fc07cd3, contentType=text/xml, http_statusCode=500, timestamp=1527886158622}]
